{
  "keyboard":{
    "settings":{
      "bot":"🤖 Бот",
      "groups":"👥 Групи",
      "add bot":"➕ Додати в групу",
      "error":"❌ Помилка. Спробуйте знову!",
      "remove":"🗑 Видалити бота",
      "save":"💾 Зберегти",
      "confirm":"✅ Підтвердити",
      "next list":"▶️ Далі",
      "back list":"◀️ Назад",
      "back":"◀️ Повернутися",
      "fiat":"💶 Фіатні валюти",
      "crypto":"💵 Криптовалюта",
      "stocks":"📑 Акції компаній",
      "input":"📥 даних отримання",
      "output":"📤 даних виведення"
    },
    "help":{
      "q&a":"💬 Питання\\Відповід",
      "communication":"🔗 Зв'язок"
    },
    "news":"📰 Новини",
    "other":"Інші",
    "delete":"🗑 Видалити"
  },
  "time":{
    "morning":"Доброго ранку",
    "day":"Добридень",
    "evening":"Добрий вечір",
    "night":"Доброї ночі"
  },
  "menu":{
    "private":[
      "<b>finances — твій фінансовий помічник</b>\n\n", 
      "📊 Курси валют — вводьте будь-яку валюту світу, та отримуйте поточний курс.",
      "Напишіть валюту, що бажаєте конвертувати у довільному для вас форматі та суму конвертації(опціонально).",
      "Або ж конвертуйте* валюти одразу ж по декілька, пишучи декілька валют одним повідомленням!\n",
      "💵 Крипто валюта — використовуйте команду /crypto для отримання курсу крипто валют до шести фіатних валют(гривня, долар, євро, фунт, крона, злоти) та конвертуйте* її до бажаної вам суми.\n",
      "📑 Акції компаній — оглядайте потрібні вам акції компаній.\n\n",
      "💬 Швидко та зручно користуйтеся обмінюйтеся курсом валют прямо в листуванні з близькими\\колегами завдяки інтеграції в чати. Напишіть: @fStatisticsBot та бажана вами опція.\n",
      "👥 Додавайте finances до ваших груп та конвертуйте валюти прямо під час розмови не роблячи зайві рухи та дії. Бот все зробить за вас**\n\n",
      "<i>* — для конвертації потрібно написати суму цифрами\n",
      "** — попередньо вам може буде потрібно налаштувати його під вас</i>"
    ],
    "group":[
      "<b>finances chat manager — ваш покірний слуга в конвертації валют</b>\n",
      "🤖 Автоматичний конвертація потрібних* вам фіатних валют у будь-які валюти світу за вашим бажанням. Надайте боту інформацію про ваші побажання в валютах і отримуйте автоматичну конвертацію без жодних зайвих дій**. Зручно та швидкою\n",
      "<i>* — для огляду криптовалют потрібно вводити комаду /crypto(виняток BTC, ETH)\n",
      "** — для конвертації напишіть суму цифрами</i>"
    ]
  },
  "exchange rate":{
    "input error":"😖 Незрозуміла команда! Скористайтеся швидким набором або напишіть її правильно",
    "server error":"😖 Сервер не працює, спробуйте пізніше",
    "main rate":"Курс на {}\n{}\n\n{}",
    "sub rate":"Курс на {}\n{}"
  },
  "inline mode":{
    "server error":"😖 Сервер не працює, спробуйте пізніше",
    "choose":"Напишіть валюту або команду:",
    "choose warning":"crypto - для криптовалют \\\\ stocks - акції",
    "warning crypto":"Допишіть валюту зі списку нижче:",
    "bad request":"😖 Неправильно написана валюта!",
    "warning":"☝️ Для конвертації допишіть суму",
    "warning info":"☝️ Для конвертації вам потрібно дописати суму конвертації. Наприклад: \"грн 11\", \"gpb 57\" тощо...",
    "choose error":"🔁 Валюта не була написана, спробуйте знову"
  },
  "settings":{
    "menu":[
      "⚙️ Налаштування, оберіть потрібну опцію:\n\n",
      "🤖 Бот — змінюйте список валют конвертації для фіатних, крипто валют, а також акцій компаній\n",
      "👥 Групи — змінюйте списки валют конвертації та валют, що потрібно обробляти. "
    ],
    "choose group":"👥 Оберіть групу, для дагування:", 
    "input":"✍️ Обиріть потрібні вам валюти та підтвердіть їх!:", 
    "alert add":"➕ Валюту додано до списку",
    "alert remove":"➖ Валюту видалено зі списку",
    "output":"✍️ Оберіть з нище переліченого списку валюти, що вам потрібні:",
    "success":"🎉 Зміни успішно застосовані",
    "exit":"Зміни не було застосовано",
    "settings option":"Оберіть, потрібну для вас опцію для редагування:",
    "local error":"Налаштування доступні лише в особистих повідомлень бота!",  
    "error group list":"😢 На жаль у вас ще немає груп, що ви можете редагувати...",
    "remove":"УВАГА! Ви ризикаєте втратити всі налаштування та видилати бота з групи!",
    "success remove":"🎉 Дані успішно видалено!"
    },
  "other":{
    "donate":[
      "<b>Підтримайте розробкою нових оновлень для finances!</b>",
      "\nfinances — це open source проєкт, що розробляється на ентузіазмі та ідеях створити зручний інструмент для огляду, конвертації валют",
      "\nкрипто валют в Telegram'і, яким ви зможете скористатися щосекунди.\n",
      "Долучайтеся до створення нових оновлень своїми донатами!",
      "Або завдяки банківській картці по посиланнях нижче 👇"
    ],
    "help":{
      "main":[
        "<b>Пояснення роботи функцій боту:</b>\n\n", 
        "📊 Курси валют — вводьте будь-яку валюту світу, та отримуйте поточний курс. Напишіть валюту, що бажаєте конвертувати у довільному для вас форматі та суму конвертації(опціонально).",
        "Або ж конвертуйте* валюти одразу ж по декілька, пишучи декілька валют одним повідомленням!\n",
        "💵 Крипто валюта — використовуйте команду /crypto для отримання курсу крипто валют до шести фіатних валют(гривня, долар, євро, фунт, крона, злоти) та конвертуйте* її до бажаної вам суми.\n",
        "📑 Акції компаній — оглядайте потрібні вам акції компаній.\n\n",
        "Якщо ви знайшли помилку або якусь проблему, будь-ласка зв'яжіться зі мною!\n\n",
        "<i>* — для конвертації потрібно написати суму цифрами</i>"
      ],
      "q&a":[
        "💬 Відповіді та питання:\n\n",
        "П: Бот пише, що не розуміє N-валюту, що робити?\n",
        "В: Важко зробити підтримку усіх можливих записів та назв валют. Спробуйте написати код валюти або по іншому(якщо ви застосовували сленгову назву\\по своєму)\n",
        "П: Я пишу суму конвертації та валюти в які хочу конвертувати, але він конвертує лиш одну-дві валюти?\n",
        "В: Алгоритм роботи бота змушує користувача прописувати суму конвертації в такому випадку кожного разу або через раз.\n\n",
        "Маєте питання? Зв'яжіться за клавішою нижче" 
      ]
    },
    "privacy": {
      "text":[
        "<b>Політика конфіденційності для @fStatisticsBot (finances)</b>\n",
        "\n",
        "🔐 <b>Збір та використання даних:</b>\n",
        "— Ми збираємо інформацію з вашого профілю в Telegram (ім'я, псевдоім, ID), ID груп, де ви є адміністратором. Ці дані необхідні для роботи бота.\n",
        "— Ми зберігаємо налаштування вашого бота: списки фіатних і криптовалют, акцій, налаштування бота для груп.\n",
        "— Ми збираємо інформацію про ваш преміум-статус в Telegram (якщо такий є).\n",
        "— Ця інформація використовується для функціональності бота та покращення сервісу.\n",
        "— Ми не збираємо і не зберігаємо повідомлення з Telegram-чатів.\n",
        "\n",
        "🔒 <b>Захист та передача даних:</b>\n",
        "— Ваші дані зберігаються на захищених серверах.\n",
        "— Ми не продаємо і не передаємо ваші персональні дані третім особам.\n",
        "— Дані можуть бути передані лише у випадках, передбачених законодавством.\n",
        "\n",
        "✅ <b>Ваші права:</b>\n",
        "— Ви маєте право вимагати доступ до своїх персональних даних.\n",
        "— Ви можете вимагати виправлення або видалення ваших даних.\n",
        "— Ви можете відкликати свою згоду на обробку даних у будь-який час.\n",
        "— Щоб скористатися цими правами, звертайтеся за адресою @teferdett.\n",
        "— Ви маєте право подати скаргу до відповідного органу захисту даних.\n",
        "\n",
        "🔄 <b>Зміни в політиці конфіденційності:</b>\n",
        "— Ця політика конфіденційності може час від часу змінюватися, щоб відобразити зміни в нашій практиці або з інших операційних, юридичних або регуляторних причин.\n",
        "— Ми наполегливо рекомендуємо вам регулярно переглядати цю політику на предмет будь-яких змін.\n",
        "— Ми повідомимо вас про суттєві зміни через бота або через Telegram.\n",
        "— Продовження використання @fStatisticsBot (finances) після внесення змін означає, що ви приймаєте оновлену політику.\n",
        "— Остання версія цієї політики завжди буде доступна за допомогою команди /privacy.\n",
        "\n",
        "📅 <b>Зберігання даних</b>\n",
        "— Ваші дані будуть видалені за вашим запитом.\n",
        "\n",
        "🌐 <b>Міжнародна передача даних:</b>\n",
        "— Ваші дані можуть оброблятися та зберігатися на серверах за межами вашої країни.\n",
        "\n",
        "🍪 <b>Файли cookie та подібні технології:</b>\n",
        "— Ми не використовуємо файли cookie, оскільки @fStatisticsBot (finances) працює через платформу Telegram.\n",
        "— Telegram може використовувати власні технології відстеження, які регулюються політикою конфіденційності Telegram.\n",
        "\n",
        "📞 <b>Contact:</b>\n",
        "— Якщо у вас є питання щодо цієї політики, будь ласка, звертайтеся за адресою @teferdet.\n",
        "\n",
        "🗑 <b>Процес видалення даних:</b>\n",
        "— Щоб видалити ваші дані, надішліть запит на @teferdet.\n",
        "— Ми опрацюємо ваш запит протягом 30 днів і повідомимо вас про його завершення.\n",
        "\n",
        "📜 <b>Правова основа для обробки даних:</b>\n",
        "— Ми обробляємо ваші дані на основі вашої згоди та для виконання нашого договору з вами (надання послуг бота).\n",
        "— Деякі дані обробляються на основі наших законних інтересів, таких як покращення сервісу та забезпечення безпеки.\n",
        "\n",
        "Використовуючи @fStatisticsBot (finances), ви погоджуєтеся з цією політикою конфіденційності. Важливо, щоб ви уважно прочитали цю політику і періодично перевіряли її на наявність оновлень."
      ],
      "update":"Останнє оновлення політики конфіденційності: {}"
    },
    "info":"🤖 Версія: {}"
  }
}